---
kind: method
id: M:Autodesk.Revit.DB.CategorySet.#ctor
source: html/8b928be1-9b5b-c5e9-713d-5495947061dc.htm
---
# Autodesk.Revit.DB.CategorySet.#ctor Method

Initializes a new instance of the CategorySet class

## Syntax (C#)
```csharp
public CategorySet()
```